In [137]:
import pandas as pd
import numpy as np
from sklearn import linear_model
from word2number import w2n

In [138]:
df = pd.read_csv("hiringEdited.csv")
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [139]:
import math
median_test_scores = math.floor(df.test_score.median())
median_test_scores

8

In [140]:
df.test_score = df.test_score.fillna(median_test_scores)
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         8.0                7   72000
7     eleven         7.0                8   80000

In [141]:
print(w2n.word_to_num('two point three'))

2.3

In [142]:
df.fillna('six', inplace=True)
df

  experience  test_score  interview_score  salary
0        six         8.0                9   50000
1        six         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         8.0                7   72000
7     eleven         7.0                8   80000

In [143]:
def change(x):
    return w2n.word_to_num(x)
df['new'] = df.apply(lambda row: change(row['experience']), axis=1)
df

  experience  test_score  interview_score  salary  new
0        six         8.0                9   50000    6
1        six         8.0                6   45000    6
2       five         6.0                7   60000    5
3        two        10.0               10   65000    2
4      seven         9.0                6   70000    7
5      three         7.0               10   62000    3
6        ten         8.0                7   72000   10
7     eleven         7.0                8   80000   11

In [144]:
df = df.drop('experience', axis=1)
df

   test_score  interview_score  salary  new
0         8.0                9   50000    6
1         8.0                6   45000    6
2         6.0                7   60000    5
3        10.0               10   65000    2
4         9.0                6   70000    7
5         7.0               10   62000    3
6         8.0                7   72000   10
7         7.0                8   80000   11

In [145]:
df = df.rename(columns={'new':'experience'})
df

   test_score  interview_score  salary  experience
0         8.0                9   50000           6
1         8.0                6   45000           6
2         6.0                7   60000           5
3        10.0               10   65000           2
4         9.0                6   70000           7
5         7.0               10   62000           3
6         8.0                7   72000          10
7         7.0                8   80000          11

In [146]:
reg = linear_model.LinearRegression()

In [148]:
reg.fit(df[['experience', 'test_score', 'interview_score']],df.salary)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [149]:
reg.coef_

array([2813.00813008, 1333.33333333, 2926.82926829])

In [150]:
reg.intercept_

11869.91869918695

In [151]:
reg.predict([[2, 9, 6]])

array([47056.91056911])

In [152]:
reg.predict([[12, 10, 10]])

array([88227.64227642])